import {
  Image,
  SafeAreaView,
  ScrollView,
  StyleSheet,
  Text,
  View,
} from 'react-native';
import React from 'react';
import {COLORS, FONTS, SIZES, images} from '../../../../../constants';

type Props = {};

const TermsScreen = (props: Props) => {
  return (
    <SafeAreaView style={styles.screenStyle}>
      <ScrollView style={styles.scroolStyle}>
        <View style={{flex: 1, justifyContent: 'center', alignItems: 'center'}}>
          <Image source={images.appText} style={styles.logoSize} />
        </View>
        <Text textBreakStrategy="highQuality" style={styles.descriptionText}>
          {`پسآپ خود را موظف به رعایت حریم خصوصی شما و صیانت از محرمانگی اطلاعاتتان می‌داند. در صورتی که از طریق پسآپ به هرگونه فعالیتی اعم از عضویت در وبسایت و یا اپلیکیشن، ارسال اطلاعات، استفاده از خدمات و امکانات و ... می‌پردازید، چند دقیقه‌ای زمان را صرف مطالعه‌ی این متن بفرمایید چرا که انجام هرگونه فعالیت به منزله‌ی پذیرفتن مفاد این سند خواهد بود.
در این سند به طور دقیق و مشروح برایتان توضیح داده‌ایم که چگونه حافظ حریم شخصی و ‌محرمانگی اطلاعات شما خواهیم بود. در صورتی که پس از مطالعه‌ی سند حاضر، ابهام یا تردیدی نسبت به مفاد آن داشتید، از طریق بخش “ تماس با ما “ با آغوش باز پذیرا و پاسخگوی موارد مربوطه خواهیم بود. پسآپ متعهد است که از حریم شخصی و امنیت اطلاعات شما با استفاده از ابزار های فنی (technical)، قانونی (legal) و قراردادی (contractual) محافظت نماید و در این راستا تمام امکانات و توان خود را به کار بندد تا اطلاعاتی را که به صورت آنلاین جمع آوری می‌نماید، صیانت نماید اما در باب امور مجرمانه، حوادث و رویدادهای غیرمترقبه که سبب آن تقصیر ما نباشد، مسئولیتی بر عهده نخواهیم داشت. منشور حقوق شهروندی جمهوری اسلامی ایران که از دستاوردهای فاخر حاکمیت به شمار می‌آید، از ماده ۳۶ تا ۴۲ خود را اختصاص به موضوع حریم خصوصی داده است و ما نیز این حق را برای تمامی کاربران به رسمیت می‌شناسیم. -برخی اطلاعات شما را به منظور ارتقاء سطح خدمات و بهبود عملکرد سامانه و توسعه پسآپ جمع‌آوری و پردازش می‌کنیم و گاه مستقیماً و به صورت محدود برخی از آن‌ها را در دسترس سایر کاربران قرار می‌دهیم.
`}
        </Text>

        <Text textBreakStrategy="highQuality" style={styles.titleText}>
          عناوین این اطلاعات به شرح زیر است:
        </Text>
        <Text textBreakStrategy="highQuality" style={styles.descriptionText}>
          _ اطلاعاتی که از طریق پر کردن فرم‌های بارگذاری فایل در اختیار ما قرار
          می‌گیرد که عموماً به منظور ایجاد حساب کاربری یا حل و فصل مشکلات شما
          ذخیره می‌شود.
          {`\n`}_ جهت توسعه پسآپ و‌ ارتقاء خدمات، اطلاعات مربوط به دستگاهی که با
          آن از پسآپ استفاده گردیده از جمله مدل سخت افزار، نسخه سیستم عامل و ...
          و شبکه اینترنت را ذخیره می‌کنیم.
          {`\n`}_ زمانی که از پسآپ استفاده می‌نمایید برخی اطلاعات شما از جمله
          جزئیات نحوه استفاده از سرویس‌های ما، عبارت‌های جست و جوی شما، گزارشات
          تلفنی،IP سیستم شما، کوکی‌ها، لاگ‌ها، تگ‌های پیکسل و ... به صورت خودکار
          ذخیره می‌شود و ما از آن‌ها حراست خواهیم نمود و برخی موارد را نیز در
          مرورگر شما یا حافظه‌های پنهان دستگاه شما ذخیره می‌کنیم
          {`\n`}_ اطلاعاتی که ذخیره می‌کنیم و حتی‌الامکان در بالاترین سطوح فنی و
          علمی از آن حراست می‌کنیم را اغلب در جهات ذیل استفاده خواهیم نمود و شما
          با استفاده از پسآپ اختیار استفاده از آن‌ها را اعطا می‌نمایید:
          {`\n`}
          الف) ارتقا پسآپ و تسهیل خدمات و تأیید شفافیت جمع آوری هوشمند پسماند تر
          و خشک قابل بازیافت در راستای ساده سازی فرایند دریافت خدمات، بررسی
          پیام‌های کاربران و صاحبان کسب و کار در صورت وصول شکایت از آنان، ارتباط
          با کاربران جهت کنترل کیفیت خدمات پیگیری شکایات، اطلاع‌رسانی و غیره.
          {`\n`}
          ب) جلوگیری از ورود کاربرانی که هویت آن‌ها احراز نشده است یا بدافزارها
          به پسآپ
          {`\n`}
          ج) آزمایش و تحلیل داده‌های ذخیره شده به منظور سنجش و بهبود خدمات پسآپ
          و توسعه آن از طریق موازین، مارکتینگ، برندینگ و سایر امور تجاری.
          {`\n`}_ به جز موارد مذکور در این سند اطلاعات شما را به اشتراک نخواهیم
          گذاشت مگر در مواردی که رضایت شما را اخذ نماییم یا مراجع ذی‌صلاح قضایی
          پسآپ را مکلف به ارائه اطلاعات در موارد خاص نمایند یا مواردی که صرفاً
          به منظور ارتقاء سطح خدمات، سنجش نیاز کاربران و تشکیک مساعی اطلاعات را
          در اختیار شرکا و همکارانمان قرار دهیم که حتی در این موارد نیز صیانت از
          اطلاعات شما از طریق قالب‌های قراردادی از جمله NDA (توافقنامه عدم
          افشا)، قرارداد سکوت ( Contract of Silence ) و ... تأمین خواهد شد.
          حتی‌الامکان داده‌های تبادلی را با بهره‌مندی از SSL رمز نگاری خواهیم
          کرد.
          {`\n`}_ از حذف یا مفقود شدن داده‌ها از طریق ایجاد نسخه‌های متعدد
          پشتیبان در دوره‌های زمانی مختلف جلوگیری خواهیم نمود.
          {`\n`}_ دسترسی همکارانمان بر حسب نیاز آن‌ها بر مبنای شرح وظایف جایگاه
          سازمانی، محدود خواهد بود.
          {`\n`}_ مفاد سند حاضر در بازه‌های زمانی متفاوت و حسب نیاز های روزآمد
          فناورانه و با اعتلای مفهوم حریم شخصی در وطن مألوفمان ایران تغییر خواهد
          کرد اما تمام سعی ما بر این است که این تغییرات هیچ گونه لطمه و خللی به
          حقوق کاربران وارد نساخته و همواره در راستای صیانت روزافزون از حریم
          شخصی و اطلاعات آنان باشد؛ بدین منظور کلیه تغییرات احتمالی در این صفحه
          موجود بوده و ایجاد تغییرات بنیادین و مهم از طریق پیام‌های اختصاصی نیز
          اطلاع رسانی خواهد شد.
          {`\n`}
          {`\n`}
        </Text>
      </ScrollView>
    </SafeAreaView>
  );
};

export default TermsScreen;

const styles = StyleSheet.create({
  screenStyle: {
    flex: 1,
    backgroundColor: COLORS.light.backgroudnColor,
  },
  scroolStyle: {paddingHorizontal: 15, direction: 'rtl'},
  logoSize: {
    width: SIZES.width / 2,
    height: SIZES.height / 11,
  },
  titleText: {
    fontFamily: FONTS.h1.fontFamily,
    textAlign: 'right',
    fontSize: 15,
  },
  descriptionText: {
    fontFamily: FONTS.body4.fontFamily,
    textAlign: 'right',
    fontSize: 12,
    lineHeight: 26,
  },
  descriptionBoldText: {
    fontFamily: FONTS.h1.fontFamily,
    textAlign: 'right',
    fontSize: 14,
  },
});
